InformationRegisters/СИЗРабочегоМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СИЗРабочегоМеста</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дежурное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СредстваИндивидуальнойЗащиты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПериодичностьВыдачиСИЗРабочихМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПериодичностьВыдачиСИЗРабочихМест</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КратностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодичностьВыдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеПериодичностиВыдачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СИЗПолноеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СИЗКодыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособВыдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыдачиСИЗ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РабочиеМестаОхраныТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РабочиеМестаОхраныТруда</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловияТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеРабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствуетУсловиямТруда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзимаютсяВзносыЗаЗанятыхНаРаботахСДосрочнойПенсией</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРаботСДосрочнойПенсией</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДосрочногоНазначенияПенсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияДосрочногоНазначенияПенсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобыеУсловияТрудаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТрудаПФР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПозицииСпискаПФР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпискиПрофессийДолжностейЛьготногоПенсионногоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплачиваетсяНадбавкаЗаВредность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНадбавкиЗаВредность</Name>
					<Comment>АПК:58 различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДополнительногоОтпускаВГод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолжностьПоШтатномуРасписанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактерВыполняемыхРаботПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныеДокументыПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВредныеФакторыСопоставлены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормыСИЗСоответствуютДолжности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальноеРабочееМестоДляИнвалидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СредстваИндивидуальнойЗащитыФормы/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСвернутыйЗаголовокГруппеДополнительныеРеквизиты(Форма) Экспорт
	
	КоличествоСвойств = 0;
	КоличествоУстановленныхСвойств = 0;
	
	Для Каждого Элемент Из Форма.Элементы.ГруппаДополнительныеРеквизиты.ПодчиненныеЭлементы Цикл
		Если Элемент.Вид <> ВидГруппыФормы.ОбычнаяГруппа Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ЭлементГруппы Из Элемент.ПодчиненныеЭлементы Цикл
			Если ЭлементГруппы.Вид <> ВидПоляФормы.ПолеФлажка Тогда
				Продолжить;
			КонецЕсли;
			КоличествоСвойств = КоличествоСвойств + 1;
			Если Форма[ЭлементГруппы.ПутьКДанным] = Истина Тогда
				КоличествоУстановленныхСвойств = КоличествоУстановленныхСвойств + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(КоличествоСвойств) Тогда
		КоличествоСвойств = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
			НСтр("ru=';%1 защитное свойство;;%1 защитных свойства;%1 защитных свойств;'"), 
			КоличествоСвойств);
		Если КоличествоУстановленныхСвойств > 0 Тогда
			КоличествоУстановленныхСвойств = СтроковыеФункцииКлиентСервер.СтрокаСЧисломДляЛюбогоЯзыка(
				НСтр("ru=';%1 защитное свойство;;%1 защитных свойства;%1 защитных свойств;'"), 
				КоличествоУстановленныхСвойств);
			Форма.Элементы.ГруппаДополнительныеРеквизиты.ЗаголовокСвернутогоОтображения =
				СтрШаблон(НСтр("ru = 'Всего %1, применяется %2'"),
				КоличествоСвойств, КоличествоУстановленныхСвойств);
		Иначе
			Форма.Элементы.ГруппаДополнительныеРеквизиты.ЗаголовокСвернутогоОтображения =
				СтрШаблон(НСтр("ru = 'Всего %1'"), КоличествоСвойств);
		КонецЕсли;
	Иначе
		Форма.Элементы.ГруппаДополнительныеРеквизиты.ЗаголовокСвернутогоОтображения = НСтр("ru = 'Дополнительные реквизиты'");
	КонецЕсли;
	
КонецПроцедуры

Функция КраткийСоставСИЗ(МассивДанныхСИЗ) Экспорт
	
	Если МассивДанныхСИЗ = Неопределено Или МассивДанныхСИЗ.Количество() = 0 Тогда
		Возврат НСтр("ru = '< Не установлены >'");
	КонецЕсли;
	
	// Первые N СИЗ и M символов.
	МаксимальноеКоличествоСИЗ = 10;
	МаксимальнаяДлинаСтроки = 300;

	Счетчик = 0;
	УникальныеСИЗ = Новый Соответствие;
	
	Для Каждого СтруктураСИЗ Из МассивДанныхСИЗ Цикл
		Если Счетчик = МаксимальноеКоличествоСИЗ Тогда
			Прервать;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтруктураСИЗ.СИЗ) 
			Или УникальныеСИЗ[СтруктураСИЗ.СИЗ] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УникальныеСИЗ.Вставить(СтруктураСИЗ.СИЗ, СтруктураСИЗ);
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	КраткийСостав = "";
	ШаблонСтроки = НСтр("ru = '%1%2 (%3)'");
	
	Для Каждого КлючИЗначениеСИЗ Из УникальныеСИЗ Цикл
		СтруктураСИЗ = КлючИЗначениеСИЗ.Значение;
		ПредставлениеПериодичностиВыдачи = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
			СтруктураСИЗ.КратностьВыдачи, СтруктураСИЗ.ПериодичностьВыдачи, СтруктураСИЗ.ЕдиницаПериодичностиВыдачи,
			СтруктураСИЗ.ЕдиницаИзмерения, СтруктураСИЗ.Количество, СтруктураСИЗ.СпособВыдачи);
		Если СтруктураСИЗ.Свойство("Дежурное") И СтруктураСИЗ.Дежурное Тогда
			ПредставлениеПериодичностиВыдачи = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 - дежурное'"), ПредставлениеПериодичностиВыдачи);
		КонецЕсли;
		
		КраткийСостав = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСтроки,
			КраткийСостав, Строка(СтруктураСИЗ.СИЗ), ПредставлениеПериодичностиВыдачи);
		ШаблонСтроки = НСтр("ru = '%1;
			|%2 (%3)'");
	КонецЦикла;
	
	Если СтрДлина(КраткийСостав) > МаксимальнаяДлинаСтроки Тогда
		КраткийСостав = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1...'"), Лев(КраткийСостав, МаксимальнаяДлинаСтроки - 3));
	КонецЕсли;
	
	Возврат КраткийСостав;
	
КонецФункции

Процедура ПрочитатьСИЗ(Форма, СсылкаНаОбъект) Экспорт
	
	НаборЗаписей = РегистрыСведений.СИЗРабочегоМеста.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РабочееМесто.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	
	ЗначениеВДанныеФормы(НаборЗаписей, Форма.НормыВыдачиСИЗНаборЗаписей);
	ЗаполнитьНормыВыдачиСИЗ(Форма);
	
КонецПроцедуры

Процедура УдалитьСвязаннуюНоменклатуруСИЗ(Форма, ИдентификаторСтрокиРабочегоМеста) Экспорт
	
	СтруктураПоискаСИЗ = Новый Структура("ИдентификаторСтрокиРабочегоМеста", ИдентификаторСтрокиРабочегоМеста);
	НайденныеСтроки = Форма.Объект.НоменклатураСИЗ.НайтиСтроки(СтруктураПоискаСИЗ);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Форма.Объект.НоменклатураСИЗ.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПериодичностьВыдачиСИЗОбъекта(Форма, УстановитьЗаголовокГруппы = Ложь) Экспорт
	
	НормыСИЗМассив = Новый Массив;
	
	Для каждого СтрокаТипаНоменклатуры Из Форма.НормыВыдачиСИЗ Цикл
		Если Не ЗначениеЗаполнено(СтрокаТипаНоменклатуры.МассивСИЗ) Тогда
			Продолжить;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(НормыСИЗМассив, СтрокаТипаНоменклатуры.МассивСИЗ);
	КонецЦикла;
	
	ОписаниеПериодичности = СредстваИндивидуальнойЗащиты.МинимальнаяПериодичность(НормыСИЗМассив, "Выдачи");
	
	Форма.ПериодичностьВыдачи = ОписаниеПериодичности.Представление;
	
	Если ПустаяСтрока(Форма.ПериодичностьВыдачи) Тогда
		Форма.ПериодичностьВыдачи = НСтр("ru = '< Не установлены >'");
	КонецЕсли;
	
	Если Не УстановитьЗаголовокГруппы Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Элементы.ГруппаСИЗ.ЗаголовокСвернутогоОтображения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Нормы выдачи СИЗ: %1'"), Форма.ПериодичностьВыдачи);
	
КонецПроцедуры

Процедура УстановитьСИЗ(Форма, РезультатЗакрытия) Экспорт
	
	НайденныеСтрокиРабочегоМеста = Форма.Объект.РабочиеМеста.НайтиСтроки(
		Новый Структура("РабочееМесто, ФизическоеЛицо", РезультатЗакрытия.РабочееМесто, РезультатЗакрытия.ФизическоеЛицо));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтрокиРабочегоМеста Цикл
		НайденнаяСтрока.МассивСИЗ = Новый ФиксированныйМассив(РезультатЗакрытия.СИЗ);
		НайденнаяСтрока.КомандаСИЗ = КраткийСоставСИЗ(НайденнаяСтрока.МассивСИЗ);
	КонецЦикла;
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

#Область СправочникДолжности

Процедура ПодготовитьФормуДолжности(Форма) Экспорт
	
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются()
		Или Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СИЗРабочегоМеста) Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаСтраницы = Форма.Элементы.Найти("ГруппаСтраницы");
	
	Если ГруппаСтраницы <> Неопределено И ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет Тогда
		ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДополнитьФормуЭлементаСправочникаДолжности(Форма) Экспорт
	
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются() Тогда
		Возврат;
	КонецЕсли;
	
	СоздатьРеквизитыФормы(Форма);
	СоздатьКомандыФормы(Форма);
	
	ДобавитьЭлементыФормы(Форма);
	
КонецПроцедуры

Процедура ПрочитатьДополнительныеДанныеОбъекта(Форма, СсылкаНаОбъект, ОбработатьЗаголовокГруппы = Ложь) Экспорт
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "Владелец");
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.СИЗРабочегоМеста) Тогда
		Если ОбработатьЗаголовокГруппы Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
				Форма.Элементы, "ГруппаСИЗ", "Видимость", Ложь);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ПрочитатьСИЗ(Форма, СсылкаНаОбъект);
	ОбновитьПериодичностьВыдачиСИЗОбъекта(Форма, ОбработатьЗаголовокГруппы);
	
КонецПроцедуры

Процедура ДолжностиПриУстановкеУсловногоОформления(Форма) Экспорт
	
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы = Форма.Элементы;
	УсловноеОформление = Форма.УсловноеОформление;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗТипНоменклатуры.Имя);
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗКомандаСИЗ.Имя);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ЭлементУсловногоОформления.Отбор, "НормыВыдачиСИЗ.Пометка", Ложь);
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.НедоступныеДанныеЦвет);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.НормыВыдачиСИЗКомандаСИЗ.Имя);
	ГруппаОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы  = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "НормыВыдачиСИЗ.Пометка", Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "НормыВыдачиСИЗ.КомандаСИЗ", НСтр("ru = '< Не установлены >'"));
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполненияОбъекта(Форма, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "Владелец");
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Чтение", Метаданные.РегистрыСведений.ПериодичностьВыдачиСИЗРабочихМест) Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеНормВыдачиСИЗ(Форма, Отказ);
	
КонецПроцедуры

Процедура ЗаписатьДополнительныеДанныеОбъекта(Форма, Ссылка) Экспорт
	
	Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Форма.Объект, "Владелец");
	Если Не СредстваИндивидуальнойЗащиты.СредстваИндивидуальнойЗащитыИспользуются(Организация) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СИЗРабочегоМеста) Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = Форма.РеквизитФормыВЗначение("НормыВыдачиСИЗНаборЗаписей");
	НаборЗаписей.Очистить();
	Для каждого СтрокаТипаНоменклатуры Из Форма.НормыВыдачиСИЗ Цикл
		Если Не ЗначениеЗаполнено(СтрокаТипаНоменклатуры.МассивСИЗ) Тогда
			Продолжить;
		КонецЕсли;
		Для каждого СтрокаСИЗ Из СтрокаТипаНоменклатуры.МассивСИЗ Цикл
			СтрокаНабора = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНабора, СтрокаСИЗ);
			СтрокаНабора["РабочееМесто"] = Ссылка;
			СтрокаНабора["ТипНоменклатуры"] = СтрокаТипаНоменклатуры.ТипНоменклатуры;
			СтрокаНабора["ПредставлениеПериодичностиВыдачи"] = СредстваИндивидуальнойЗащитыКлиентСервер.ПредставлениеПериодичности(
				СтрокаНабора.КратностьВыдачи, СтрокаНабора.ПериодичностьВыдачи, СтрокаНабора.ЕдиницаПериодичностиВыдачи,
				СтрокаНабора.ЕдиницаИзмерения, СтрокаНабора.Количество, СтрокаНабора.СпособВыдачи);
		КонецЦикла;
	КонецЦикла;
	
	НаборЗаписей.Отбор.РабочееМесто.Установить(Ссылка);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура УстановитьСИЗПослеЗакрытияНаСервере(Форма, РезультатЗакрытия, ДополнительныеПараметры, УстановитьЗаголовокГруппы = Ложь) Экспорт
	
	ТипНоменклатуры = РезультатЗакрытия.ТипНоменклатуры;
	СИЗ = РезультатЗакрытия.СИЗ;
	
	НайденныеСтрокиРабочегоМеста = Форма.НормыВыдачиСИЗ.НайтиСтроки(Новый Структура("ТипНоменклатуры", ТипНоменклатуры));
	
	Для Каждого НайденнаяСтрока Из НайденныеСтрокиРабочегоМеста Цикл
		НайденнаяСтрока.МассивСИЗ = Новый ФиксированныйМассив(СИЗ);
		НайденнаяСтрока.КомандаСИЗ = КраткийСоставСИЗ(НайденнаяСтрока.МассивСИЗ);
	КонецЦикла;
	
	ОбновитьПериодичностьВыдачиСИЗОбъекта(Форма, УстановитьЗаголовокГруппы);
	
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

Процедура ДолжностиПриКопированииНормВыдачи(Форма, Результат, ДополнительныеПараметры) Экспорт
	СкопироватьНормыВыдачиИзДругойДолжности(Форма, Результат);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СправочникДолжности

#Область КонструированиеФормы

Процедура СоздатьРеквизитыФормы(Форма)
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"НормыВыдачиСИЗ", 
			Новый ОписаниеТипов("ТаблицаЗначений"),
			,
			НСтр("ru = 'Нормы выдачи СИЗ'"), 
			Истина));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"Пометка", 
			Новый ОписаниеТипов("Булево"),
			"НормыВыдачиСИЗ",
			НСтр("ru = 'Пометка'")));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"ТипНоменклатуры", 
			Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНоменклатуры"),
			"НормыВыдачиСИЗ",
			НСтр("ru = 'Тип СИЗ'")));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"КомандаСИЗ", 
			Новый ОписаниеТипов("Строка"),
			"НормыВыдачиСИЗ",
			НСтр("ru = 'Команда СИЗ'")));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"МассивСИЗ", 
			Новый ОписаниеТипов(),
			"НормыВыдачиСИЗ",
			НСтр("ru = 'Массив СИЗ'")));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"НормыВыдачиСИЗНаборЗаписей", 
			Новый ОписаниеТипов("РегистрСведенийНаборЗаписей.СИЗРабочегоМеста"),
			,
			НСтр("ru = 'Нормы выдачи СИЗ'"), 
			Истина));
	
	ДобавляемыеРеквизиты.Добавить(
		Новый РеквизитФормы(
			"ПериодичностьВыдачи", 
			Новый ОписаниеТипов("Строка"),
			,
			НСтр("ru = 'Периодичность выдачи'")));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);

КонецПроцедуры

Процедура СоздатьКомандыФормы(Форма)
	
	Если Форма.Команды.Найти("СкопироватьНормыВыдачи") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КомандаСкопировать = Форма.Команды.Добавить("СкопироватьНормыВыдачи");
	КомандаСкопировать.Действие = "Подключаемый_СкопироватьНормыВыдачи";
	КомандаСкопировать.Заголовок = НСтр("ru = 'Скопировать из другой должности...'");
	КомандаСкопировать.ИзменяетСохраняемыеДанные = Истина;
	КомандаСкопировать.Подсказка = НСтр("ru = 'Скопировать нормы выдачи средств индивидуальной защиты из другой должности'");
	
	КомандаСнятьФлажки = Форма.Команды.Добавить("СнятьФлажки");
	КомандаСнятьФлажки.Действие = "Подключаемый_СнятьФлажки";
	КомандаСнятьФлажки.Заголовок = НСтр("ru = 'Снять флажки'");
	КомандаСнятьФлажки.ИзменяетСохраняемыеДанные = Истина;
	КомандаСнятьФлажки.Картинка = БиблиотекаКартинок.СнятьФлажки;
	КомандаСнятьФлажки.Подсказка = НСтр("ru = 'Снять флажки'");
	
	КомандаСнятьФлажки = Форма.Команды.Добавить("УстановитьФлажки");
	КомандаСнятьФлажки.Действие = "Подключаемый_УстановитьФлажки";
	КомандаСнятьФлажки.Заголовок = НСтр("ru = 'Установить флажки'");
	КомандаСнятьФлажки.ИзменяетСохраняемыеДанные = Истина;
	КомандаСнятьФлажки.Картинка = БиблиотекаКартинок.УстановитьФлажки;
	КомандаСнятьФлажки.Подсказка = НСтр("ru = 'Установить флажки'");
	
КонецПроцедуры

Процедура ДобавитьЭлементыФормы(Форма)
	
	Элементы = Форма.Элементы;
	ГруппаРазмещения = Элементы.Найти("СредстваИндивидуальнойЗащитыГруппа");
	ГруппаРазмещения.Заголовок = НСтр("ru = 'Средства индивидуальной защиты'");
	ГруппаРазмещения.ОтображатьЗаголовок = Истина;
	ГруппаРазмещения.Отображение = ОтображениеОбычнойГруппы.СлабоеВыделение;
	ГруппаРазмещения.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ДобавитьЭлементыПериодичность(Элементы, ГруппаРазмещения);
	ДобавитьЭлементыГруппыНормыВыдачиСИЗ(Элементы, ГруппаРазмещения);
	
КонецПроцедуры

Процедура ДобавитьЭлементыПериодичность(Элементы, ГруппаРазмещения)
	
	Если Элементы.Найти("ПериодичностьВыдачиГруппа") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПериодичностьВыдачиГруппа = Элементы.Добавить("ПериодичностьВыдачиГруппа", Тип("ГруппаФормы"), ГруппаРазмещения);
	ПериодичностьВыдачиГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ПериодичностьВыдачиГруппа.ОтображатьЗаголовок = Ложь;
	ПериодичностьВыдачиГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ПериодичностьВыдачиГруппа.РастягиватьПоГоризонтали = Истина;
	
	ПредставлениеПериодичностиВыдачи = Элементы.Добавить("ПредставлениеПериодичностиВыдачи", Тип("ПолеФормы"), ПериодичностьВыдачиГруппа);
	ПредставлениеПериодичностиВыдачи.Вид = ВидПоляФормы.ПолеВвода;
	ПредставлениеПериодичностиВыдачи.Заголовок = НСтр("ru = 'Периодичность выдачи'");
	ПредставлениеПериодичностиВыдачи.ПутьКДанным = "ПериодичностьВыдачи";
	ПредставлениеПериодичностиВыдачи.ТолькоПросмотр = Истина;
	ПредставлениеПериодичностиВыдачи.Подсказка = НСтр("ru = 'Работа в этих условиях труда требует выдачу СИЗ не реже указанного.'");
	ПредставлениеПериодичностиВыдачи.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	ПредставлениеПериодичностиВыдачи.Ширина = 10;
	
	СкопироватьКнопка = Элементы.Добавить("СкопироватьНормыВыдачи", Тип("КнопкаФормы"), ПериодичностьВыдачиГруппа);
	СкопироватьКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
	СкопироватьКнопка.ИмяКоманды = "СкопироватьНормыВыдачи";
	СкопироватьКнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	
КонецПроцедуры

Процедура ДобавитьЭлементыГруппыНормыВыдачиСИЗ(Элементы, ГруппаРазмещения)
	
	Если Элементы.Найти("НормыВыдачиСИЗГруппа") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НормыВыдачиСИЗГруппа = Элементы.Добавить("НормыВыдачиСИЗГруппа", Тип("ГруппаФормы"), ГруппаРазмещения);
	НормыВыдачиСИЗГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НормыВыдачиСИЗГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	НормыВыдачиСИЗГруппа.ОтображатьЗаголовок = Ложь;
	НормыВыдачиСИЗГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	НормыВыдачиСИЗГруппа.Подсказка = НСтр("ru = 'Перечисленные нормы определяют периодичность выдачи СИЗ сотрудников, кроме того, их перечень заполняется в разнарядке на выдачу.'");
	НормыВыдачиСИЗГруппа.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	НормыВыдачиСИЗГруппа.РасширеннаяПодсказка.АвтоМаксимальнаяШирина = Ложь;
	
	НормыВыдачиСИЗКоманднаяПанель = Элементы.Добавить("НормыВыдачиСИЗКоманднаяПанель", Тип("ГруппаФормы"), НормыВыдачиСИЗГруппа);
	НормыВыдачиСИЗКоманднаяПанель.Вид = ВидГруппыФормы.КоманднаяПанель;
	
	УправлениеФлажками = Элементы.Добавить("УправлениеФлажками", Тип("ГруппаФормы"), НормыВыдачиСИЗКоманднаяПанель);
	УправлениеФлажками.Вид = ВидГруппыФормы.ГруппаКнопок;
	
	УстановитьФлажкиКнопка = Элементы.Добавить("УстановитьФлажки", Тип("КнопкаФормы"), УправлениеФлажками);
	УстановитьФлажкиКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	УстановитьФлажкиКнопка.ИмяКоманды = "УстановитьФлажки";
	
	СнятьФлажкиКнопка = Элементы.Добавить("СнятьФлажки", Тип("КнопкаФормы"), УправлениеФлажками);
	СнятьФлажкиКнопка.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	СнятьФлажкиКнопка.ИмяКоманды = "СнятьФлажки";
	
	// Таблица "Нормы выдачи СИЗ".
	НормыВыдачиСИЗ = Элементы.Добавить("НормыВыдачиСИЗ", Тип("ТаблицаФормы"), НормыВыдачиСИЗГруппа);
	НормыВыдачиСИЗ.ПутьКДанным = "НормыВыдачиСИЗ";
	НормыВыдачиСИЗ.АвтоВводНовойСтроки = Ложь;
	НормыВыдачиСИЗ.Высота = 2;
	НормыВыдачиСИЗ.Заголовок = "Нормы выдачи СИЗ";
	НормыВыдачиСИЗ.ИзменятьПорядокСтрок = Ложь;
	НормыВыдачиСИЗ.ИзменятьСоставСтрок = Ложь;
	НормыВыдачиСИЗ.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НормыВыдачиСИЗ.РежимВыделения = РежимВыделенияТаблицы.Множественный;
	НормыВыдачиСИЗ.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.Авто;
	НормыВыдачиСИЗ.УстановитьДействие("Выбор","Подключаемый_НормыВыдачиСИЗВыбор");
	НормыВыдачиСИЗ.УстановитьДействие("ПриОкончанииРедактирования","Подключаемый_НормыВыдачиСИЗПриОкончанииРедактирования");
	НормыВыдачиСИЗ.УстановитьДействие("ПослеУдаления","Подключаемый_НормыВыдачиСИЗПослеУдаления");
	
	НормыВыдачиСИЗПометка = Элементы.Добавить("НормыВыдачиСИЗПометка", Тип("ПолеФормы"), НормыВыдачиСИЗ);
	НормыВыдачиСИЗПометка.ПутьКДанным = "НормыВыдачиСИЗ.Пометка";
	НормыВыдачиСИЗПометка.Вид = ВидПоляФормы.ПолеФлажка;
	НормыВыдачиСИЗПометка.УстановитьДействие("ПриИзменении","Подключаемый_НормыВыдачиСИЗПометкаПриИзменении");
	
	НормыВыдачиСИЗТипНоменклатуры = Элементы.Добавить("НормыВыдачиСИЗТипНоменклатуры", Тип("ПолеФормы"), НормыВыдачиСИЗ);
	НормыВыдачиСИЗТипНоменклатуры.ПутьКДанным = "НормыВыдачиСИЗ.ТипНоменклатуры";
	НормыВыдачиСИЗТипНоменклатуры.Вид = ВидПоляФормы.ПолеНадписи;
	НормыВыдачиСИЗТипНоменклатуры.РастягиватьПоГоризонтали = Ложь;
	НормыВыдачиСИЗТипНоменклатуры.Ширина = 30;
	НормыВыдачиСИЗТипНоменклатуры.АвтоМаксимальнаяШирина = Ложь;
	
	НормыВыдачиСИЗКомандаСИЗ = Элементы.Добавить("НормыВыдачиСИЗКомандаСИЗ", Тип("ПолеФормы"), НормыВыдачиСИЗ);
	НормыВыдачиСИЗКомандаСИЗ.ПутьКДанным = "НормыВыдачиСИЗ.КомандаСИЗ";
	НормыВыдачиСИЗКомандаСИЗ.Вид = ВидПоляФормы.ПолеВвода;
	НормыВыдачиСИЗКомандаСИЗ.ГиперссылкаЯчейки = Истина;
	НормыВыдачиСИЗКомандаСИЗ.ЦветТекста = ЦветаСтиля.ГиперссылкаЦвет;
	НормыВыдачиСИЗКомандаСИЗ.Заголовок = НСтр("ru = 'Нормы выдачи СИЗ'");
	НормыВыдачиСИЗКомандаСИЗ.ТолькоПросмотр = Истина;
	
КонецПроцедуры

#КонецОбласти

Процедура СкопироватьНормыВыдачиИзДругойДолжности(Форма, ДолжностьИсточник)
	
	ПрочитатьСИЗ(Форма, ДолжностьИсточник);
	ОбновитьПериодичностьВыдачиСИЗОбъекта(Форма);
	Форма.Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьНормыВыдачиСИЗ(Форма)
	
	Если Форма.НормыВыдачиСИЗ.Количество() > 0 Тогда
		Форма.НормыВыдачиСИЗ.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТипыНоменклатуры.Ссылка КАК ТипНоменклатуры,
		|	ТипыНоменклатуры.Порядок КАК Порядок
		|ИЗ
		|	Перечисление.ТипыНоменклатуры КАК ТипыНоменклатуры
		|
		|УПОРЯДОЧИТЬ ПО
		|	Порядок";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПараметрыОписанияСтрокиСИЗ = СредстваИндивидуальнойЗащитыКлиентСервер.ПараметрыОписанияСтрокиСИЗ();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Форма.НормыВыдачиСИЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.КомандаСИЗ = НСтр("ru = '< Не установлены >'");
		ОтборСтрок = Новый Структура("ТипНоменклатуры", ВыборкаДетальныеЗаписи.ТипНоменклатуры);
		НайденныеСтроки = Форма.НормыВыдачиСИЗНаборЗаписей.НайтиСтроки(ОтборСтрок);
		НоваяСтрока.Пометка = НайденныеСтроки.Количество() > 0;
		Если НоваяСтрока.Пометка Тогда
			ЗаполнитьМассивСИЗ(Форма.НормыВыдачиСИЗНаборЗаписей, НоваяСтрока, "ТипНоменклатуры", ПараметрыОписанияСтрокиСИЗ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМассивСИЗ(ТаблицаСИЗ, СтрокаТаблицы, ИмяПоля, ПараметрыОписания, ДанныеСИЗ = Неопределено) Экспорт
	
	СИЗНаРабочемМесте = Новый Массив;
	
	НайденныеСтроки = ТаблицаСИЗ.НайтиСтроки(Новый Структура(ИмяПоля, СтрокаТаблицы[ИмяПоля]));
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		Описание = СредстваИндивидуальнойЗащитыКлиентСервер.ОписаниеСтрокиСИЗ(ПараметрыОписания);
		ЗаполнитьЗначенияСвойств(Описание, НайденнаяСтрока);
		Если ТипЗнч(ДанныеСИЗ) = Тип("Соответствие") Тогда
			ЗаполнитьЗначенияСвойств(Описание, ДанныеСИЗ.Получить(НайденнаяСтрока.СИЗ));
		КонецЕсли;
		СИЗНаРабочемМесте.Добавить(Описание);
	КонецЦикла;
	
	СтрокаТаблицы.МассивСИЗ = Новый ФиксированныйМассив(СИЗНаРабочемМесте);
	СтрокаТаблицы.КомандаСИЗ = КраткийСоставСИЗ(СтрокаТаблицы.МассивСИЗ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеНормВыдачиСИЗ(Форма, Отказ)
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "НормыВыдачиСИЗ") Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из Форма.НормыВыдачиСИЗ Цикл
		Если СтрокаТаблицы.Пометка И Не ЗначениеЗаполнено(СтрокаТаблицы.МассивСИЗ) Тогда
			ТекстСообщения = НСтр("ru = 'Нормы СИЗ не установлены.'");
			НомерСтроки = Форма.НормыВыдачиСИЗ.Индекс(СтрокаТаблицы) + 1;
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("НормыВыдачиСИЗ", НомерСтроки, "КомандаСИЗ");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , Поле, , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатыПакетаЗапросовДляИзмененияНормВыдачиРабочихМест(Форма, ИспользоватьОтбор, ОтборРабочихМест) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РабочиеМестаСправочник.Ссылка КАК РабочееМесто,
		|	ВЫБОР
		|		КОГДА ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				РегистрСведений.СИЗРабочегоМеста КАК СИЗРабочегоМеста
		|			ГДЕ
		|				СИЗРабочегоМеста.РабочееМесто = РабочиеМестаСправочник.Ссылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСИЗ,
		|	ПериодичностьВыдачиСИЗРабочихМест.СИЗПолноеПредставление КАК СИЗПолноеПредставление,
		|	ПериодичностьВыдачиСИЗРабочихМест.ПредставлениеПериодичностиВыдачи КАК ПредставлениеПериодичностиВыдачи,
		|	РабочиеМестаСправочник.ПорядковыйНомер КАК ПорядковыйНомер
		|ИЗ
		|	Справочник.РабочиеМестаОхраныТруда КАК РабочиеМестаСправочник
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПериодичностьВыдачиСИЗРабочихМест КАК ПериодичностьВыдачиСИЗРабочихМест
		|		ПО РабочиеМестаСправочник.Ссылка = ПериодичностьВыдачиСИЗРабочихМест.РабочееМесто
		|ГДЕ
		|	РабочиеМестаСправочник.ЭтоГруппа = ЛОЖЬ
		|	И ВЫБОР
		|		КОГДА &ЕстьОтборРабочихМест
		|			ТОГДА РабочиеМестаСправочник.Ссылка В (&РабочиеМеста)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ЕстьОрганизация
		|			ТОГДА РабочиеМестаСправочник.Владелец = &Организация
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ЕстьПодразделение
		|			ТОГДА РабочиеМестаСправочник.Подразделение = &Подразделение
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|
		|	ПорядковыйНомер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СИЗРабочегоМеста.РабочееМесто,
		|	СИЗРабочегоМеста.СИЗ,
		|	СИЗРабочегоМеста.Количество,
		|	СИЗРабочегоМеста.ЕдиницаИзмерения,
		|	СИЗРабочегоМеста.ТипНоменклатуры,
		|	СИЗРабочегоМеста.СпособВыдачи,
		|	СИЗРабочегоМеста.КратностьВыдачи,
		|	СИЗРабочегоМеста.ПериодичностьВыдачи,
		|	СИЗРабочегоМеста.ЕдиницаПериодичностиВыдачи,
		|	СИЗРабочегоМеста.Дежурное
		|ИЗ
		|	РегистрСведений.СИЗРабочегоМеста КАК СИЗРабочегоМеста
		|ГДЕ
		|	ВЫБОР
		|		КОГДА &ЕстьОтборРабочихМест
		|			ТОГДА СИЗРабочегоМеста.РабочееМесто В (&РабочиеМеста)
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ЕстьОрганизация
		|			ТОГДА СИЗРабочегоМеста.РабочееМесто.Владелец = &Организация
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ
		|	И ВЫБОР
		|		КОГДА &ЕстьПодразделение
		|			ТОГДА СИЗРабочегоМеста.РабочееМесто.Подразделение = &Подразделение
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("ЕстьОтборРабочихМест", ИспользоватьОтбор);
	Запрос.УстановитьПараметр("РабочиеМеста", ОтборРабочихМест);
	Запрос.УстановитьПараметр("ЕстьОрганизация", ЗначениеЗаполнено(Форма.Организация));
	Запрос.УстановитьПараметр("Организация", Форма.Организация);
	Запрос.УстановитьПараметр("ЕстьПодразделение", ЗначениеЗаполнено(Форма.Подразделение));
	Запрос.УстановитьПараметр("Подразделение", Форма.Подразделение);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

#КонецОбласти
